In [6]:
import pandas as pd
import numpy as np
import sqlite3

*Создание игрушечных данных через pandas:*

In [4]:
df = pd.DataFrame({"user_id":[1,2,3],
                   "user_name":['a','b','c']})

In [5]:
df

   user_id user_name
0        1         a
1        2         b
2        3         c

In [7]:
con = sqlite3.connect('db')

In [8]:
df.to_sql('users',con,index=False,if_exists='replace')

3

In [9]:
sql='''select * from users t'''

In [10]:
pd.read_sql(sql,con)

   user_id user_name
0        1         a
1        2         b
2        3         c

In [11]:
def select(sql):
    return pd.read_sql(sql,con)

In [12]:
select(sql)

   user_id user_name
0        1         a
1        2         b
2        3         c

*Создание игрушечных данных через гугл-таблицы:*

* создаем в гугле табличку, расшариваем доступ и копируем ссылку

https://docs.google.com/spreadsheets/d/15DV1h7x1zsNDdF0iQCHJhNuFi-c85bwKxYq5Dk7M5bU/edit?usp=sharing

In [ ]:
# Вычленяем id из ссылки

In [14]:
id = '15DV1h7x1zsNDdF0iQCHJhNuFi-c85bwKxYq5Dk7M5bU'

In [15]:
# Читаем данные с помощью следующей строки

In [17]:
df1 = pd.read_csv(f'https://docs.google.com/spreadsheets/d/{id}/export?format=csv')

In [18]:
df1

   user_id name
0        2    b
1        3    c
2        4    d

In [19]:
df1.to_sql('users2',con,index=False,if_exists='replace')

3

In [20]:
sql = '''select * from users2 t1'''

In [21]:
select(sql)

   user_id name
0        2    b
1        3    c
2        4    d